Kevincoooool/N32G032/Software/CMSIS/device/n32g032.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g032.h
 * @author Nations Solution Team
 * @version v1.0.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#ifndef __N32G032_H__
#define __N32G032_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup N32G032_Library_Basic
 * @{
 */

#if !defined USE_STDPERIPH_DRIVER
/*
 * Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will
   be based on direct access to peripherals registers
   */
#define USE_STDPERIPH_DRIVER
#endif

/*
 * In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.
  */
#if !defined HSE_VALUE
#define HSE_VALUE (8000000) /*!< Value of the External oscillator in Hz */
#endif                      /* HSE_VALUE */

/*
 * In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value
   */
#define HSE_STARTUP_TIMEOUT ((uint16_t)0x0500) /*!< Time out for HSE start up */
#define HSI_STARTUP_TIMEOUT ((uint16_t)0x0500) /*!< Time out for HSI start up */
#define LSE_STARTUP_TIMEOUT ((uint16_t)0x1000) /*!< Time out for LSE start up */
#define LSI_STARTUP_TIMEOUT ((uint16_t)0x1000) /*!< Time out for LSI start up */

#define HSI_VALUE (8000000) /*!< Value of the Internal oscillator in Hz*/

#define LSE_VALUE (32768) /*!< Value of the External Low Speed oscillator in Hz*/
#define LSI_VALUE (30000) /*!< Value of the Internal Low Speed oscillator in Hz*/

#define __N32G032_STDPERIPH_VERSION_MAIN (0x01) /*!< [31:24] main version */
#define __N32G032_STDPERIPH_VERSION_SUB1 (0x00) /*!< [23:16] sub1 version */
#define __N32G032_STDPERIPH_VERSION_SUB2 (0x00) /*!< [15:8]  sub2 version */
#define __N32G032_STDPERIPH_VERSION_RC   (0x00) /*!< [7:0]  release candidate */

/**
 * @brief N32G032 Standard Peripheral Library version number
 */
#define __N32G032_STDPERIPH_VERSION                                                                                    \
    ((__N32G032_STDPERIPH_VERSION_MAIN << 24) | (__N32G032_STDPERIPH_VERSION_SUB1 << 16)                               \
     | (__N32G032_STDPERIPH_VERSION_SUB2 << 8) | (__N32G032_STDPERIPH_VERSION_RC))

/*
 * Configuration of the Cortex-M0 Processor and Core Peripherals
 */
#define __NVIC_PRIO_BITS       2 /*!< N32G032 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used */

/**
 * @brief N32G032 Interrupt Number Definition
 */
typedef enum IRQn
{
    /******  Cortex-M0 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn      = -14, /*!< 2 Non Maskable Interrupt                            */
    HardFault_IRQn           = -13, /*!< 3 Hard Fault Interrupt                              */
    SVCall_IRQn              = -5,  /*!< 11 Cortex-M0 SV Call Interrupt                      */
    PendSV_IRQn              = -2,  /*!< 14 Cortex-M0 Pend SV Interrupt                      */
    SysTick_IRQn             = -1,  /*!< 15 Cortex-M0 System Tick Interrupt                  */

    /******  N32G032 specific Interrupt Numbers ********************************************************/
    WWDG_IRQn                = 0,  /*!< Window WatchDog Interrupt                            */
    PVD_IRQn                 = 1,  /*!< PVD through EXTI Line 16 detection Interrupt         */
    RTC_IRQn                 = 2,  /*!< RTC interrupt through EXTI line 17/19/20             */
    MMU_IRQn                 = 3,  /*!< MMU global Interrupt                                 */
    FLASH_IRQn               = 4,  /*!< FLASH global Interrupt                               */
    RCC_IRQn                 = 5,  /*!< RCC global Interrupt                                 */
    EXTI0_1_IRQn             = 6,  /*!< EXTI Line0/1 Interrupt                               */
    EXTI2_3_IRQn             = 7,  /*!< EXTI Line2/3 Interrupt                               */
    EXTI4_15_IRQn            = 8,  /*!< EXTI Line4 ~ 15 Interrupt                            */
    TSC_IRQn                 = 9,  /*!< TSC global Interrupt                                 */
    SAC_IRQn                 = 10, /*!< SAC global Interrupt                                 */
    DMA_Channel1_2_3_4_IRQn  = 11, /*!< DMA Channel 1/2/3/4 global Interrupt                 */
    DMA_Channel5_6_7_8_IRQn  = 12, /*!< DMA Channel 5/6/7/8 global Interrupt                 */
    TIM1_BRK_UP_TRG_COM_IRQn = 13, /*!< TIM1 Break Update Trigger and Commutation Interrupt  */
    TIM1_CC_IRQn             = 14, /*!< TIM1 Capture Compare Interrupt                       */
    CAN_IRQn                 = 15, /*!< CAN global Interrupt                                 */
    TIM3_IRQn                = 16, /*!< TIM3 global Interrupt                                */
    TIM4_IRQn                = 17, /*!< TIM4 global Interrupt                                */
    TIM8_BRK_UP_TRG_COM_IRQn = 18, /*!< TIM8 Break Update Trigger and Commutation Interrupt  */
    TIM8_CC_IRQn             = 19, /*!< TIM8 Capture Compare Interrupt                       */
    LPTIM_TIM6_IRQn          = 20, /*!< LPTIM / TIM6 global Interrupts                       */
    ADC_IRQn                 = 21, /*!< ADC global Interrupts                                */
    SPI2_3_IRQn              = 22, /*!< SPI2 / SPI3 global Interrupts                        */
    I2C1_IRQn                = 23, /*!< I2C1 global Interrupts                               */
    I2C2_IRQn                = 24, /*!< I2C2 global Interrupts                               */
    SPI1_IRQn                = 25, /*!< SPI1 global Interrupts                               */
    HDIV_SQRT_IRQn           = 26, /*!< HDIV / SQRT global Interrupts                        */
    RAMC_PERR_IRQn           = 27, /*!< RAMC PARITY ERR Interrupt                            */
    USART1_2_IRQn            = 28, /*!< USART1 / USART2 global Interrupt                     */
    LPUART1_2_IRQn           = 29, /*!< LPUART1 / LPUART2 global Interrupt                   */
    UART5_6_IRQn             = 30, /*!< UART5 / UART6 global Interrupt                       */
    COMP1_2_3_IRQn           = 31, /*!< COMP1(through EXTI line 18)/COMP2/COMP3 Interrupt    */

} IRQn_Type;

#include "core_cm0.h"
#include "system_n32g032.h"
#include <stdint.h>
#include <stdbool.h>

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32; /*!< Read Only */
typedef const int16_t sc16; /*!< Read Only */
typedef const int8_t sc8;   /*!< Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

typedef __I int32_t vsc32; /*!< Read Only */
typedef __I int16_t vsc16; /*!< Read Only */
typedef __I int8_t vsc8;   /*!< Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t u8;

