Kevincoooool/N32G032/Software/CMSIS/device/n32g032.h
#define PWR_CTRL_PLS                          ((uint16_t)0x01E0)     /*!< voltage threshold level ,a total 16 gears. Range: 1.8 ~ 5V ,one step need add 200mv */
#define PWR_CTRL_PLS0                         ((uint16_t)0x0000)     /*!< voltage threshold around 1.8 V */
//#define PWR_CTRL_PLS1                         ((uint16_t)(1 << PLS_OFFSET))     /*!< voltage threshold around 2.1 V */
//#define PWR_CTRL_PLS2                         ((uint16_t)(2 << PLS_OFFSET))     /*!< voltage threshold around 2.25 V */
//#define PWR_CTRL_PLS3                         ((uint16_t)(3 << PLS_OFFSET))     /*!< voltage threshold around 2.4 V */
//#define PWR_CTRL_PLS4                         ((uint16_t)(4 << PLS_OFFSET))     /*!< voltage threshold around 2.55 V */
//#define PWR_CTRL_PLS5                         ((uint16_t)(5 << PLS_OFFSET))     /*!< voltage threshold around 2.7 V */
//#define PWR_CTRL_PLS6                         ((uint16_t)(6 << PLS_OFFSET))     /*!< voltage threshold around 2.85 V */
//#define PWR_CTRL_PLS7                         ((uint16_t)(7 << PLS_OFFSET))     /*!< voltage threshold around 2.95 V */
//#define PWR_CTRL_PLS8                         ((uint16_t)(8 << PLS_OFFSET))     /*!< external input analog voltage PVD_IN (compared internally to VREFINT) */

#define PWR_CTRL_PDR                           ((uint16_t)0x0200)     /*!< Adjust the voltage of VDDD PDR on stop mode */
#define PWR_CTRL_STOPPLUSEN                    ((uint16_t)0x0400)     /*!< When this bit is set, further reduce power consumption on stop mode . */
/********************  Bit definition for PWR_CTRLSTS register  ********************/
#define PWR_CTRLSTS_WKUPF                     ((uint16_t)0x0001)     /*!< on DBGPD mode,wakeup pin occurs wakeup event,hardware setup*/
#define PWR_CTRLSTS_DBGPDF                    ((uint16_t)0x0002)     /*!< DBGPD state flag */
#define PWR_CTRLSTS_PVDO                      ((uint16_t)0x0004)     /*!< Power voltage detector output */
#define PWR_CTRLSTS_WKUP0EN                   ((uint16_t)0x0010)     /*!< wakeup enable ,PA0  */
#define PWR_CTRLSTS_WKUP1EN                   ((uint16_t)0x0020)     /*!< wakeup enable ,PC13  */
#define PWR_CTRLSTS_WKUP2EN                   ((uint16_t)0x0040)     /*!< wakeup enable ,PA2  */
#define PWR_CTRLSTS_WKUPPOL                   ((uint16_t)0x0080)     /*!< wakeup polarity select  */
/********************  Bit definition for PWR_CTRL2 register  ********************/
#define PWR_CTRL2_IWDGRSTEN                   ((uint16_t)0x0400)     /*!< IWDG reset enable */
/********************  Bit definition for PWR_CTRL3 register  ********************/
#define PWR_CTRL3_LSIEN                       ((uint16_t)0x0080)     /*!< when enter STOP mode,LSI control mode selection */
/********************  Bit definition for PWR_CTRL4 register  ********************/
#define PWR_CTRL4_FLASHWKUP                       ((uint16_t)0x0001)     /*!< FLASH wakeup mode selection,normal mode or quickly mode */
#define PWR_CTRL4_STBFLASH                        ((uint16_t)0x0002)      /*!< FLASH STANDBY mode enable */
#define PWR_CTRL4_LPRUNEN                         ((uint16_t)0x0010)     /*!< Low-power run mode enable */
#define PWR_CTRL4_LPRUNFLH                        ((uint16_t)0x0020)     /*!< when enter LPRUN mode,FLASH work mode selection */
#define PWR_CTRL4_LPRUNSTS                        ((uint16_t)0x0040)     /*!< Low-power run state */
/********************  Bit definition for PWR_CTRL5 register  ********************/
#define PWR_CTRL5_SLPMRSEL                        ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage selection */
#define PWR_CTRL5_SLPMRSEL_1V5                    ((uint16_t)0x0004)     /*!< when enter STOP mode,MR voltage select 1.5V*/
#define PWR_CTRL5_SLPMRSEL_1V2                    ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage select 1.2V*/
#define PWR_CTRL5_SLPMRSEL_1V0                    ((uint16_t)0x0008)     /*!< when enter STOP mode,MR voltage select 1.0V*/
/********************  Bit definition for PWR_CTRL6 register  ********************/
#define PWR_CTRL6_SLPMREN                         ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage selection output enable*/
#define PWR_CTRL6_SLPMREN_1V5                     ((uint16_t)0x0000)     /*!< when enter STOP mode,MR voltage select 1.5V output*/
#define PWR_CTRL6_SLPMREN_BY                      ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage select output from SLPMRSEL*/

/********************  Bit definition for PWR_DBGCTRL register  ********************/
#define PWR_DBGCTRL_STOP                              ((uint32_t)0x00000002)     /*!< Debug on stop mode enable*/
#define PWR_DBGCTRL_PD                                ((uint32_t)0x00000004)     /*!< Debug on PD mode enable*/
#define PWR_DBGCTRL_IWDGSTP                           ((uint32_t)0x00000100)     /*!< when enter debug mode,IWDG work mode selection*/
#define PWR_DBGCTRL_WWDGSTP                           ((uint32_t)0x00000200)     /*!< when enter debug mode,WWDG work mode selection*/
#define PWR_DBGCTRL_TIM1STP                           ((uint32_t)0x00000400)     /*!< when enter debug mode,TIM1 work mode selection*/
#define PWR_DBGCTRL_TIM3STP                           ((uint32_t)0x00001000)     /*!< when enter debug mode,TIM3 work mode selection*/
#define PWR_DBGCTRL_TIM4STP                           ((uint32_t)0x00002000)     /*!< when enter debug mode,TIM4 work mode selection*/
#define PWR_DBGCTRL_CANSTP                            ((uint32_t)0x00004000)     /*!< when enter debug mode,CAN work mode selection*/
#define PWR_DBGCTRL_I2C1TIMOUT                        ((uint32_t)0x00008000)     /*!< when enter debug mode,I2C1 timeout work mode selection*/
#define PWR_DBGCTRL_I2C2TIMOUT                        ((uint32_t)0x00010000)     /*!< when enter debug mode,I2C2 timeout TIM8 work mode selection*/
#define PWR_DBGCTRL_TIM8STP                           ((uint32_t)0x00020000)     /*!< when enter debug mode,LPTIM work mode selection*/
#define PWR_DBGCTRL_TIM6STP                           ((uint32_t)0x00080000)     /*!< when enter debug mode,TIM6 work mode selection*/

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for RCC_CTRL register  ********************/
#define RCC_CTRL_HSIEN    ((uint32_t)0x00000001) /*!< Internal High Speed clock enable */
#define RCC_CTRL_HSIRDF   ((uint32_t)0x00000002) /*!< Internal High Speed clock ready flag */
#define RCC_CTRL_HSITRIM  ((uint32_t)0x000000F8) /*!< Internal High Speed clock trimming */
#define RCC_CTRL_HSEEN    ((uint32_t)0x00010000) /*!< External High Speed clock enable */
#define RCC_CTRL_HSERDF   ((uint32_t)0x00020000) /*!< External High Speed clock ready flag */
#define RCC_CTRL_CLKSSEN  ((uint32_t)0x00080000) /*!< Clock Security System enable */
#define RCC_CTRL_PLLBP    ((uint32_t)0x00400000) /*!< PLL clock Bypass */
#define RCC_CTRL_PLLOUTEN ((uint32_t)0x00800000) /*!< PLL clock Out Enable */
#define RCC_CTRL_PLLEN    ((uint32_t)0x01000000) /*!< PLL enable */
#define RCC_CTRL_PLLRDF   ((uint32_t)0x02000000) /*!< PLL clock ready flag */

#define RCC_CTRL_HSEIOSEL       ((uint32_t)0x0C000000) /*!< HSE Input GPIO Selection */
#define RCC_CTRL_HSEIOSEL_PA0BP ((uint32_t)0x00000000) /*!< Select PA0 Bypass mode input clock as HSE */
#define RCC_CTRL_HSEIOSEL_PF0BP ((uint32_t)0x04000000) /*!< Select PF0 Bypass mode input clock as HSE */
#define RCC_CTRL_HSEIOSEL_PF0   ((uint32_t)0x08000000) /*!< Select PF0 oscillator input clock as HSE */

/*******************  Bit definition for RCC_CFG register  *******************/
/*!< SCLKSW configuration */
#define RCC_CFG_SCLKSW   ((uint32_t)0x00000003) /*!< SCLKSW[1:0] bits (System clock Switch) */
#define RCC_CFG_SCLKSW_0 ((uint32_t)0x00000001) /*!< Bit 0 */
#define RCC_CFG_SCLKSW_1 ((uint32_t)0x00000002) /*!< Bit 1 */
#define RCC_CFG_SCLKSW_2 ((uint32_t)0x00000004) /*!< Bit 2 */

#define RCC_CFG_SCLKSW_HSI ((uint32_t)0x00000000) /*!< HSI selected as system clock */
#define RCC_CFG_SCLKSW_HSE ((uint32_t)0x00000001) /*!< HSE selected as system clock */
#define RCC_CFG_SCLKSW_PLL ((uint32_t)0x00000002) /*!< PLL selected as system clock */
#define RCC_CFG_SCLKSW_LSE ((uint32_t)0x00000003) /*!< LSE selected as system clock */
#define RCC_CFG_SCLKSW_LSI ((uint32_t)0x00000004) /*!< LSI selected as system clock */

/*!< SCLKSTS configuration */
#define RCC_CFG_SCLKSTS   ((uint32_t)0x0000C008) /*!< SCLKSTS[2:0] bits (System Clock Switch Status) */
#define RCC_CFG_SCLKSTS_0 ((uint32_t)0x00000008) /*!< Bit 0 */
#define RCC_CFG_SCLKSTS_1 ((uint32_t)0x00004000) /*!< Bit 1 */
#define RCC_CFG_SCLKSTS_2 ((uint32_t)0x00008000) /*!< Bit 1 */

#define RCC_CFG_SCLKSTS_HSI ((uint32_t)0x00000000) /*!< HSI oscillator used as system clock */
#define RCC_CFG_SCLKSTS_HSE ((uint32_t)0x00000008) /*!< HSE oscillator used as system clock */
#define RCC_CFG_SCLKSTS_PLL ((uint32_t)0x00004000) /*!< PLL used as system clock */
#define RCC_CFG_SCLKSTS_LSE ((uint32_t)0x00004008) /*!< LSE oscillator used as system clock */
#define RCC_CFG_SCLKSTS_LSI ((uint32_t)0x00008000) /*!< LSI oscillator used as system clock */

/*!< AHBPRES configuration */
#define RCC_CFG_AHBPRES   ((uint32_t)0x000000F0) /*!< AHBPRES[3:0] bits (AHB prescaler) */
#define RCC_CFG_AHBPRES_0 ((uint32_t)0x00000010) /*!< Bit 0 */
#define RCC_CFG_AHBPRES_1 ((uint32_t)0x00000020) /*!< Bit 1 */
#define RCC_CFG_AHBPRES_2 ((uint32_t)0x00000040) /*!< Bit 2 */
#define RCC_CFG_AHBPRES_3 ((uint32_t)0x00000080) /*!< Bit 3 */

#define RCC_CFG_AHBPRES_DIV1   ((uint32_t)0x00000000) /*!< SYSCLK not divided */
#define RCC_CFG_AHBPRES_DIV2   ((uint32_t)0x00000080) /*!< SYSCLK divided by 2 */
#define RCC_CFG_AHBPRES_DIV4   ((uint32_t)0x00000090) /*!< SYSCLK divided by 4 */
#define RCC_CFG_AHBPRES_DIV8   ((uint32_t)0x000000A0) /*!< SYSCLK divided by 8 */
#define RCC_CFG_AHBPRES_DIV16  ((uint32_t)0x000000B0) /*!< SYSCLK divided by 16 */
#define RCC_CFG_AHBPRES_DIV64  ((uint32_t)0x000000C0) /*!< SYSCLK divided by 64 */
#define RCC_CFG_AHBPRES_DIV128 ((uint32_t)0x000000D0) /*!< SYSCLK divided by 128 */
#define RCC_CFG_AHBPRES_DIV256 ((uint32_t)0x000000E0) /*!< SYSCLK divided by 256 */
#define RCC_CFG_AHBPRES_DIV512 ((uint32_t)0x000000F0) /*!< SYSCLK divided by 512 */

/*!< APB1PRES configuration */
#define RCC_CFG_APB1PRES   ((uint32_t)0x00000700) /*!< APB1PRES[2:0] bits (APB1 prescaler) */
#define RCC_CFG_APB1PRES_0 ((uint32_t)0x00000100) /*!< Bit 0 */
#define RCC_CFG_APB1PRES_1 ((uint32_t)0x00000200) /*!< Bit 1 */
#define RCC_CFG_APB1PRES_2 ((uint32_t)0x00000400) /*!< Bit 2 */

