Kevincoooool/N32G032/Software/CMSIS/device/n32g032.h
/*******************  Bit definition for COMP1_CTRL register  ********************/
#define COMP1_CTRL_EN     ((uint32_t)0x00000001) /*!< COMP1 Enable */
#define COMP1_CTRL_INMSEL ((uint32_t)0x0000000E) /*!< COMP1 Inverting Input Selection */
#define COMP1_CTRL_INPSEL ((uint32_t)0x00000070) /*!< COMP1 Non Inverting Input Selection */
#define COMP1_CTRL_OUTTRG ((uint32_t)0x00000780) /*!< COMP1 Output trigger */
#define COMP1_CTRL_POL    ((uint32_t)0x00000800) /*!< COMP1 Output invert */
#define COMP1_CTRL_HYST   ((uint32_t)0x00003000) /*!< COMP1 Output Hysteresis Level */
#define COMP1_CTRL_BLKING ((uint32_t)0x0001C000) /*!< COMP1 Output Blanking */
#define COMP1_CTRL_OUT    ((uint32_t)0x00020000) /*!< COMP1 Output Status */
#define COMP1_CTRL_INPDAC ((uint32_t)0x00040000) /*!< COMP1 -- */
#define COMP1_CTRL_PWRMD  ((uint32_t)0x00080000) /*!< COMP1 Power Mode Selection */
#define COMP1_CTRL_CLKSEL ((uint32_t)0x00080000) /*!< COMP1 Clock Select During STOP and Low Power Mode */

/*******************  Bit definition for COMP1_FILC register  ********************/
#define COMP1_FILC_FILEN   ((uint32_t)0x00000001) /*!< COMP1 Filter Enable */
#define COMP1_FILC_THRESH  ((uint32_t)0x0000003E) /*!< COMP1 Low Filter Majority Voting Threshold */
#define COMP1_FILC_SAMPWIN ((uint32_t)0x000007C0) /*!< COMP1 Low Filter Sample Window Size */

/*******************  Bit definition for COMP1_FILP register  ********************/
#define COMP1_FILP_CLKPSC  ((uint32_t)0x0000FFFF) /*!< COMP1 Low Filter Sample Clock Prescale */

/*******************  Bit definition for COMP2_CTRL register  ********************/
#define COMP2_CTRL_EN     ((uint32_t)0x00000001) /*!< COMP2 Enable */
#define COMP2_CTRL_INMSEL ((uint32_t)0x0000000E) /*!< COMP2 Inverting Input Selection */
#define COMP2_CTRL_INPSEL ((uint32_t)0x00000070) /*!< COMP2 Non Inverting Input Selection */
#define COMP2_CTRL_OUTTRG ((uint32_t)0x00000780) /*!< COMP2 Output trigger */
#define COMP2_CTRL_POL    ((uint32_t)0x00000800) /*!< COMP2 Output invert */
#define COMP2_CTRL_HYST   ((uint32_t)0x00003000) /*!< COMP2 Output Hysteresis Level */
#define COMP2_CTRL_BLKING ((uint32_t)0x0001C000) /*!< COMP2 Output Blanking */
#define COMP2_CTRL_OUT    ((uint32_t)0x00020000) /*!< COMP2 Output Status */
#define COMP2_CTRL_WINOUT ((uint32_t)0x00040000) /*!< COMP2 -- */

/*******************  Bit definition for COMP2_FILC register  ********************/
#define COMP2_FILC_FILEN   ((uint32_t)0x00000001) /*!< COMP2 Filter Enable */
#define COMP2_FILC_THRESH  ((uint32_t)0x0000003E) /*!< COMP2 Low Filter Majority Voting Threshold */
#define COMP2_FILC_SAMPWIN ((uint32_t)0x000007C0) /*!< COMP2 Low Filter Sample Window Size */

/*******************  Bit definition for COMP2_FILP register  ********************/
#define COMP2_FILP_CLKPSC  ((uint32_t)0x0000FFFF) /*!< COMP2 Low Filter Sample Clock Prescale */

/*******************  Bit definition for COMP3_CTRL register  ********************/
#define COMP3_CTRL_EN     ((uint32_t)0x00000001) /*!< COMP3 Enable */
#define COMP3_CTRL_INMSEL ((uint32_t)0x0000000E) /*!< COMP3 Inverting Input Selection */
#define COMP3_CTRL_INPSEL ((uint32_t)0x00000070) /*!< COMP3 Non Inverting Input Selection */
#define COMP3_CTRL_OUTTRG ((uint32_t)0x00000780) /*!< COMP3 Output trigger */
#define COMP3_CTRL_POL    ((uint32_t)0x00000800) /*!< COMP3 Output invert */
#define COMP3_CTRL_HYST   ((uint32_t)0x00003000) /*!< COMP3 Output Hysteresis Level */
#define COMP3_CTRL_BLKING ((uint32_t)0x0001C000) /*!< COMP3 Output Blanking */
#define COMP3_CTRL_OUT    ((uint32_t)0x00020000) /*!< COMP3 Output Status */

/*******************  Bit definition for COMP3_FILC register  ********************/
#define COMP3_FILC_FILEN   ((uint32_t)0x00000001) /*!< COMP3 Filter Enable */
#define COMP3_FILC_THRESH  ((uint32_t)0x0000003E) /*!< COMP3 Low Filter Majority Voting Threshold */
#define COMP3_FILC_SAMPWIN ((uint32_t)0x000007C0) /*!< COMP3 Low Filter Sample Window Size */

/*******************  Bit definition for COMP3_FILP register  ********************/
#define COMP3_FILP_CLKPSC  ((uint32_t)0x0000FFFF) /*!< COMP3 Low Filter Sample Clock Prescale */

/*******************  Bit definition for COMP_INVREF register  ********************/
#define COMP_INVREF_VREF1EN  ((uint32_t)0x00000001) /*!< COMP Reference Input Comparison Voltage 1 Enable */
#define COMP_INVREF_VREF1SEL ((uint32_t)0x0000007E) /*!< COMP Reference Input Comparison Voltage 1 Selection */
#define COMP_INVREF_VREF2EN  ((uint32_t)0x00000080) /*!< COMP Reference Input Comparison Voltage 2 Enable */
#define COMP_INVREF_VREF2SEL ((uint32_t)0x00003F00) /*!< COMP Reference Input Comparison Voltage 2 Selection */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SPI_CTRL1 register  ********************/
#define SPI_CTRL1_CLKPHA ((uint16_t)0x0001) /*!< Clock Phase */
#define SPI_CTRL1_CLKPOL ((uint16_t)0x0002) /*!< Clock Polarity */
#define SPI_CTRL1_MSEL   ((uint16_t)0x0004) /*!< Master Selection */

#define SPI_CTRL1_BR  ((uint16_t)0x0038) /*!< BR[2:0] bits (Baud Rate Control) */
#define SPI_CTRL1_BR0 ((uint16_t)0x0008) /*!< Bit 0 */
#define SPI_CTRL1_BR1 ((uint16_t)0x0010) /*!< Bit 1 */
#define SPI_CTRL1_BR2 ((uint16_t)0x0020) /*!< Bit 2 */

#define SPI_CTRL1_SPIEN     ((uint16_t)0x0040) /*!< SPI Enable */
#define SPI_CTRL1_LSBFF     ((uint16_t)0x0080) /*!< Frame Format */
#define SPI_CTRL1_SSEL      ((uint16_t)0x0100) /*!< Internal slave select */
#define SPI_CTRL1_SSMEN     ((uint16_t)0x0200) /*!< Software slave management */
#define SPI_CTRL1_RONLY     ((uint16_t)0x0400) /*!< Receive only */
#define SPI_CTRL1_DATFF     ((uint16_t)0x0800) /*!< Data Frame Format */
#define SPI_CTRL1_CRCNEXT   ((uint16_t)0x1000) /*!< Transmit CRC next */
#define SPI_CTRL1_CRCEN     ((uint16_t)0x2000) /*!< Hardware CRC calculation enable */
#define SPI_CTRL1_BIDIROEN  ((uint16_t)0x4000) /*!< Output enable in bidirectional mode */
#define SPI_CTRL1_BIDIRMODE ((uint16_t)0x8000) /*!< Bidirectional data mode enable */

