Kevincoooool/N32G032/Software/CMSIS/device/n32g032.h
/******************  Bit definition for GPIO_AFL register  *******************/
#define GPIO_AFL_AFSEL0  ((uint32_t)0x0000000F) /*!< Port x AFL bit (0..3) */
#define GPIO_AFL_AFSEL1  ((uint32_t)0x000000F0) /*!< Port x AFL bit (4..7) */
#define GPIO_AFL_AFSEL2  ((uint32_t)0x00000F00) /*!< Port x AFL bit (8..11) */
#define GPIO_AFL_AFSEL3  ((uint32_t)0x0000F000) /*!< Port x AFL bit (12..15) */
#define GPIO_AFL_AFSEL4  ((uint32_t)0x000F0000) /*!< Port x AFL bit (16..19) */
#define GPIO_AFL_AFSEL5  ((uint32_t)0x00F00000) /*!< Port x AFL bit (20..23) */
#define GPIO_AFL_AFSEL6  ((uint32_t)0x0F000000) /*!< Port x AFL bit (24..27) */
#define GPIO_AFL_AFSEL7  ((uint32_t)0xF0000000) /*!< Port x AFL bit (27..31) */

/******************  Bit definition for GPIO_AFH register  *******************/
#define GPIO_AFH_AFSEL8  ((uint32_t)0x0000000F) /*!< Port x AFH bit (0..3) */
#define GPIO_AFH_AFSEL9  ((uint32_t)0x000000F0) /*!< Port x AFH bit (4..7) */
#define GPIO_AFH_AFSEL10 ((uint32_t)0x00000F00) /*!< Port x AFH bit (8..11) */
#define GPIO_AFH_AFSEL11 ((uint32_t)0x0000F000) /*!< Port x AFH bit (12..15) */
#define GPIO_AFH_AFSEL12 ((uint32_t)0x000F0000) /*!< Port x AFH bit (16..19) */
#define GPIO_AFH_AFSEL13 ((uint32_t)0x00F00000) /*!< Port x AFH bit (20..23) */
#define GPIO_AFH_AFSEL14 ((uint32_t)0x0F000000) /*!< Port x AFH bit (24..27) */
#define GPIO_AFH_AFSEL15 ((uint32_t)0xF0000000) /*!< Port x AFH bit (27..31) */

/*******************  Bit definition for GPIO_PBC register  *******************/
#define GPIO_PBC_PBC0  ((uint16_t)0x0001) /*!< Port x Reset bit 0 */
#define GPIO_PBC_PBC1  ((uint16_t)0x0002) /*!< Port x Reset bit 1 */
#define GPIO_PBC_PBC2  ((uint16_t)0x0004) /*!< Port x Reset bit 2 */
#define GPIO_PBC_PBC3  ((uint16_t)0x0008) /*!< Port x Reset bit 3 */
#define GPIO_PBC_PBC4  ((uint16_t)0x0010) /*!< Port x Reset bit 4 */
#define GPIO_PBC_PBC5  ((uint16_t)0x0020) /*!< Port x Reset bit 5 */
#define GPIO_PBC_PBC6  ((uint16_t)0x0040) /*!< Port x Reset bit 6 */
#define GPIO_PBC_PBC7  ((uint16_t)0x0080) /*!< Port x Reset bit 7 */
#define GPIO_PBC_PBC8  ((uint16_t)0x0100) /*!< Port x Reset bit 8 */
#define GPIO_PBC_PBC9  ((uint16_t)0x0200) /*!< Port x Reset bit 9 */
#define GPIO_PBC_PBC10 ((uint16_t)0x0400) /*!< Port x Reset bit 10 */
#define GPIO_PBC_PBC11 ((uint16_t)0x0800) /*!< Port x Reset bit 11 */
#define GPIO_PBC_PBC12 ((uint16_t)0x1000) /*!< Port x Reset bit 12 */
#define GPIO_PBC_PBC13 ((uint16_t)0x2000) /*!< Port x Reset bit 13 */
#define GPIO_PBC_PBC14 ((uint16_t)0x4000) /*!< Port x Reset bit 14 */
#define GPIO_PBC_PBC15 ((uint16_t)0x8000) /*!< Port x Reset bit 15 */

/*******************  Bit definition for GPIO_DS register ******************/
#define GPIO_DS_DS0  ((uint16_t)0x0001) /*!<  Port x driver strength bit 0 */
#define GPIO_DS_DS1  ((uint16_t)0x0002) /*!<  Port x driver strength bit 1 */
#define GPIO_DS_DS2  ((uint16_t)0x0004) /*!<  Port x driver strength bit 2 */
#define GPIO_DS_DS3  ((uint16_t)0x0008) /*!<  Port x driver strength bit 3 */
#define GPIO_DS_DS4  ((uint16_t)0x0010) /*!<  Port x driver strength bit 4 */
#define GPIO_DS_DS5  ((uint16_t)0x0020) /*!<  Port x driver strength bit 5 */
#define GPIO_DS_DS6  ((uint16_t)0x0040) /*!<  Port x driver strength bit 6 */
#define GPIO_DS_DS7  ((uint16_t)0x0080) /*!<  Port x driver strength bit 7 */
#define GPIO_DS_DS8  ((uint16_t)0x0100) /*!<  Port x driver strength bit 8 */
#define GPIO_DS_DS9  ((uint16_t)0x0200) /*!<  Port x driver strength bit 9 */
#define GPIO_DS_DS10 ((uint16_t)0x0400) /*!<  Port x driver strength bit 10 */
#define GPIO_DS_DS11 ((uint16_t)0x0800) /*!<  Port x driver strength bit 11 */
#define GPIO_DS_DS12 ((uint16_t)0x1000) /*!<  Port x driver strength bit 12 */
#define GPIO_DS_DS13 ((uint16_t)0x2000) /*!<  Port x driver strength bit 13 */
#define GPIO_DS_DS14 ((uint16_t)0x4000) /*!<  Port x driver strength bit 14 */
#define GPIO_DS_DS15 ((uint16_t)0x8000) /*!<  Port x driver strength bit 15 */

/*----------------------------------------------------------------------------*/

/*****************  Bit definition for AFIO_CFG register  *****************/
#define AFIO_CFG_I2C2_LV_EN  ((uint32_t)0x40000000) /*!< AFIO_CFG bit 30 */
#define AFIO_CFG_I2C1_LV_EN  ((uint32_t)0x20000000) /*!< AFIO_CFG bit 29 */
#define AFIO_CFG_TIM4CH2_RMP ((uint32_t)0x10000000) /*!< AFIO_CFG bit 28 */
#define AFIO_CFG_SPI3_NSS    ((uint32_t)0x01000000) /*!< AFIO_CFG bit 24 */
#define AFIO_CFG_SPI2_NSS    ((uint32_t)0x00800000) /*!< AFIO_CFG bit 23 */
#define AFIO_CFG_SPI1_NSS    ((uint32_t)0x00400000) /*!< AFIO_CFG bit 22 */
#define AFIO_CFG_TSC_OUT     ((uint32_t)0x00200000) /*!< AFIO_CFG bit 21 */
#define AFIO_CFG_ADC_ETRI    ((uint32_t)0x00100000) /*!< AFIO_CFG bit 20 */
#define AFIO_CFG_ADC_ETRR    ((uint32_t)0x00080000) /*!< AFIO_CFG bit 19 */
#define AFIO_CFG_EXTI_ETRI   ((uint32_t)0x00078000) /*!< AFIO_CFG bit (15..18) */
#define AFIO_CFG_EXTI_ETRR   ((uint32_t)0x00007800) /*!< AFIO_CFG bit (11..14) */

/*****************  Bit definition for AFIO_EXTI_CFG1 register  *****************/
#define AFIO_EXTI_CFG1_EXTI0 ((uint16_t)0x000F) /*!< EXTI 0 configuration */
#define AFIO_EXTI_CFG1_EXTI1 ((uint16_t)0x00F0) /*!< EXTI 1 configuration */
#define AFIO_EXTI_CFG1_EXTI2 ((uint16_t)0x0F00) /*!< EXTI 2 configuration */
#define AFIO_EXTI_CFG1_EXTI3 ((uint16_t)0xF000) /*!< EXTI 3 configuration */

/*!< EXTI0 configuration */
#define AFIO_EXTI_CFG1_EXTI0_PA ((uint16_t)0x0000) /*!< PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB ((uint16_t)0x0001) /*!< PB[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PC ((uint16_t)0x0002) /*!< PC[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD ((uint16_t)0x0003) /*!< PD[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PF ((uint16_t)0x0005) /*!< PF[0] pin */

/*!< EXTI1 configuration */
#define AFIO_EXTI_CFG1_EXTI1_PA ((uint16_t)0x0000) /*!< PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB ((uint16_t)0x0010) /*!< PB[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PC ((uint16_t)0x0020) /*!< PC[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD ((uint16_t)0x0030) /*!< PD[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PF ((uint16_t)0x0050) /*!< PF[1] pin */

/*!< EXTI2 configuration */
#define AFIO_EXTI_CFG1_EXTI2_PA ((uint16_t)0x0000) /*!< PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB ((uint16_t)0x0100) /*!< PB[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PC ((uint16_t)0x0200) /*!< PC[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD ((uint16_t)0x0300) /*!< PD[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PF ((uint16_t)0x0500) /*!< PF[2] pin */

/*!< EXTI3 configuration */
#define AFIO_EXTI_CFG1_EXTI3_PA ((uint16_t)0x0000) /*!< PA[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB ((uint16_t)0x1000) /*!< PB[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PC ((uint16_t)0x2000) /*!< PC[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD ((uint16_t)0x3000) /*!< PD[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PF ((uint16_t)0x5000) /*!< PF[3] pin */

