Kevincoooool/N32G032/Software/CMSIS/device/n32g032.h
/******************  Bit definition for EXTI_SWIE register  ******************/
#define EXTI_SWIE_SWIE0  ((uint32_t)0x00000001) /*!< Software Interrupt on line 0 */
#define EXTI_SWIE_SWIE1  ((uint32_t)0x00000002) /*!< Software Interrupt on line 1 */
#define EXTI_SWIE_SWIE2  ((uint32_t)0x00000004) /*!< Software Interrupt on line 2 */
#define EXTI_SWIE_SWIE3  ((uint32_t)0x00000008) /*!< Software Interrupt on line 3 */
#define EXTI_SWIE_SWIE4  ((uint32_t)0x00000010) /*!< Software Interrupt on line 4 */
#define EXTI_SWIE_SWIE5  ((uint32_t)0x00000020) /*!< Software Interrupt on line 5 */
#define EXTI_SWIE_SWIE6  ((uint32_t)0x00000040) /*!< Software Interrupt on line 6 */
#define EXTI_SWIE_SWIE7  ((uint32_t)0x00000080) /*!< Software Interrupt on line 7 */
#define EXTI_SWIE_SWIE8  ((uint32_t)0x00000100) /*!< Software Interrupt on line 8 */
#define EXTI_SWIE_SWIE9  ((uint32_t)0x00000200) /*!< Software Interrupt on line 9 */
#define EXTI_SWIE_SWIE10 ((uint32_t)0x00000400) /*!< Software Interrupt on line 10 */
#define EXTI_SWIE_SWIE11 ((uint32_t)0x00000800) /*!< Software Interrupt on line 11 */
#define EXTI_SWIE_SWIE12 ((uint32_t)0x00001000) /*!< Software Interrupt on line 12 */
#define EXTI_SWIE_SWIE13 ((uint32_t)0x00002000) /*!< Software Interrupt on line 13 */
#define EXTI_SWIE_SWIE14 ((uint32_t)0x00004000) /*!< Software Interrupt on line 14 */
#define EXTI_SWIE_SWIE15 ((uint32_t)0x00008000) /*!< Software Interrupt on line 15 */
#define EXTI_SWIE_SWIE16 ((uint32_t)0x00010000) /*!< Software Interrupt on line 16 */
#define EXTI_SWIE_SWIE17 ((uint32_t)0x00020000) /*!< Software Interrupt on line 17 */
#define EXTI_SWIE_SWIE18 ((uint32_t)0x00040000) /*!< Software Interrupt on line 18 */
#define EXTI_SWIE_SWIE19 ((uint32_t)0x00080000) /*!< Software Interrupt on line 19 */
#define EXTI_SWIE_SWIE20 ((uint32_t)0x00100000) /*!< Software Interrupt on line 20 */
#define EXTI_SWIE_SWIE21 ((uint32_t)0x00200000) /*!< Software Interrupt on line 21 */
#define EXTI_SWIE_SWIE22 ((uint32_t)0x00400000) /*!< Software Interrupt on line 22 */
#define EXTI_SWIE_SWIE23 ((uint32_t)0x00800000) /*!< Software Interrupt on line 23 */

/*******************  Bit definition for EXTI_PEND register  ********************/
#define EXTI_PEND_PEND0  ((uint32_t)0x00000001) /*!< Pending bit for line 0 */
#define EXTI_PEND_PEND1  ((uint32_t)0x00000002) /*!< Pending bit for line 1 */
#define EXTI_PEND_PEND2  ((uint32_t)0x00000004) /*!< Pending bit for line 2 */
#define EXTI_PEND_PEND3  ((uint32_t)0x00000008) /*!< Pending bit for line 3 */
#define EXTI_PEND_PEND4  ((uint32_t)0x00000010) /*!< Pending bit for line 4 */
#define EXTI_PEND_PEND5  ((uint32_t)0x00000020) /*!< Pending bit for line 5 */
#define EXTI_PEND_PEND6  ((uint32_t)0x00000040) /*!< Pending bit for line 6 */
#define EXTI_PEND_PEND7  ((uint32_t)0x00000080) /*!< Pending bit for line 7 */
#define EXTI_PEND_PEND8  ((uint32_t)0x00000100) /*!< Pending bit for line 8 */
#define EXTI_PEND_PEND9  ((uint32_t)0x00000200) /*!< Pending bit for line 9 */
#define EXTI_PEND_PEND10 ((uint32_t)0x00000400) /*!< Pending bit for line 10 */
#define EXTI_PEND_PEND11 ((uint32_t)0x00000800) /*!< Pending bit for line 11 */
#define EXTI_PEND_PEND12 ((uint32_t)0x00001000) /*!< Pending bit for line 12 */
#define EXTI_PEND_PEND13 ((uint32_t)0x00002000) /*!< Pending bit for line 13 */
#define EXTI_PEND_PEND14 ((uint32_t)0x00004000) /*!< Pending bit for line 14 */
#define EXTI_PEND_PEND15 ((uint32_t)0x00008000) /*!< Pending bit for line 15 */
#define EXTI_PEND_PEND16 ((uint32_t)0x00010000) /*!< Pending bit for line 16 */
#define EXTI_PEND_PEND17 ((uint32_t)0x00020000) /*!< Pending bit for line 17 */
#define EXTI_PEND_PEND18 ((uint32_t)0x00040000) /*!< Pending bit for line 18 */
#define EXTI_PEND_PEND19 ((uint32_t)0x00080000) /*!< Pending bit for line 19 */
#define EXTI_PEND_PEND20 ((uint32_t)0x00100000) /*!< Pending bit for line 20 */
#define EXTI_PEND_PEND21 ((uint32_t)0x00200000) /*!< Pending bit for line 21 */
#define EXTI_PEND_PEND22 ((uint32_t)0x00400000) /*!< Pending bit for line 22 */
#define EXTI_PEND_PEND23 ((uint32_t)0x00800000) /*!< Pending bit for line 23 */

/*******************  Bit definition for EXTI_TS_SEL register  ********************/
#define EXTI_TS_SEL_TSSEL       ((uint16_t)0x000F) /*!< EXTI_TS_SEL */

#define EXTI_TS_SEL_TSSEL_EXTI0  ((uint16_t)0x0000) /*!< EXTI_TS_SEL EXTI0 */
#define EXTI_TS_SEL_TSSEL_EXTI1  ((uint16_t)0x0001) /*!< EXTI_TS_SEL EXTI1 */
#define EXTI_TS_SEL_TSSEL_EXTI2  ((uint16_t)0x0002) /*!< EXTI_TS_SEL EXTI2 */
#define EXTI_TS_SEL_TSSEL_EXTI3  ((uint16_t)0x0003) /*!< EXTI_TS_SEL EXTI3 */
#define EXTI_TS_SEL_TSSEL_EXTI4  ((uint16_t)0x0004) /*!< EXTI_TS_SEL EXTI4 */
#define EXTI_TS_SEL_TSSEL_EXTI5  ((uint16_t)0x0005) /*!< EXTI_TS_SEL EXTI5 */
#define EXTI_TS_SEL_TSSEL_EXTI6  ((uint16_t)0x0006) /*!< EXTI_TS_SEL EXTI6 */
#define EXTI_TS_SEL_TSSEL_EXTI7  ((uint16_t)0x0007) /*!< EXTI_TS_SEL EXTI7 */
#define EXTI_TS_SEL_TSSEL_EXTI8  ((uint16_t)0x0008) /*!< EXTI_TS_SEL EXTI8 */
#define EXTI_TS_SEL_TSSEL_EXTI9  ((uint16_t)0x0009) /*!< EXTI_TS_SEL EXTI9 */
#define EXTI_TS_SEL_TSSEL_EXTI10 ((uint16_t)0x000A) /*!< EXTI_TS_SEL EXTI10 */
#define EXTI_TS_SEL_TSSEL_EXTI11 ((uint16_t)0x000B) /*!< EXTI_TS_SEL EXTI11 */
#define EXTI_TS_SEL_TSSEL_EXTI12 ((uint16_t)0x000C) /*!< EXTI_TS_SEL EXTI12 */
#define EXTI_TS_SEL_TSSEL_EXTI13 ((uint16_t)0x000D) /*!< EXTI_TS_SEL EXTI13 */
#define EXTI_TS_SEL_TSSEL_EXTI14 ((uint16_t)0x000E) /*!< EXTI_TS_SEL EXTI14 */
#define EXTI_TS_SEL_TSSEL_EXTI15 ((uint16_t)0x000F) /*!< EXTI_TS_SEL EXTI15 */

/******************************************************************************/
/*                                                                            */
/*                                 TSC Registers           	                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for TSC_CTRL register 		   ****************/

#define TSC_CTRL_TM4_ETR       ((uint16_t)0x1000)
#define TSC_CTRL_DET_INTEN     ((uint16_t)0x0400)
#define TSC_CTRL_GREAT_DET_SEL ((uint16_t)0x0200)
#define TSC_CTRL_LESS_DET_SEL  ((uint16_t)0x0100)
#define TSC_CTRL_HW_DET_ST     ((uint16_t)0x0080)
#define TSC_CTRL_HW_DET_MODE   ((uint16_t)0x0040)
#define TSC_DET_FILTER		   ((uint16_t)0x0030)
#define TSC_DET_PERIOD		   ((uint16_t)0x000F)

/****************  Bit definition for TSC TSC_STS register      ****************/
#define TSC_STS_CHN_NUM_BIT         ((uint32_t)0x000F0000)
#define TSC_STS_GREAT_DET_BIT        ((uint32_t)0x00002000)
#define TSC_STS_LESS_DET_BIT         ((uint32_t)0x00001000)
#define TSC_STS_CNT_VAL_BIT          ((uint32_t)0x000007FF)

/****************  Bit definition for TSC_ANA_CTRL register 		   ****************/
#define TSC_ANA_CTRL_SW_TSC_EN      ((uint16_t)0x0020)
#define TSC_ANA_CTRL_SW_PAD_MUX     ((uint16_t)0x000F)

/****************  Bit definition for TSC_ANA_SEL register 		   ****************/
#define TSC_ANA_SEL_PAD_OPT     ((uint16_t)0x0040)
#define TSC_ANA_SEL_SP_OPT      ((uint16_t)0x0030)

/****************  Bit definition for TSC_THRHDx register 		   ****************/
#define TSC_THRHD_DELTA     ((uint32_t)0x00FF0000)      /*!<TSC_THRHD register delta bit */
#define TSC_THRHD_BASE      ((uint32_t)0x000003FF)      /*!<TSC_THRHD register base bit */

