Kevincoooool/N32G032/Software/CMSIS/device/n32g032.h
/****************  Bit definition for TSC TSC_CHNEN register      ****************/
#define TSC_CHNEN_CHN_SEL0  ((uint32_t)0x00000001) /*!< Channel 0 enable bit */
#define TSC_CHNEN_CHN_SEL1  ((uint32_t)0x00000002) /*!< Channel 1 enable bit */
#define TSC_CHNEN_CHN_SEL2  ((uint32_t)0x00000004) /*!< Channel 2 enable bit */
#define TSC_CHNEN_CHN_SEL3  ((uint32_t)0x00000008) /*!< Channel 3 enable bit */
#define TSC_CHNEN_CHN_SEL4  ((uint32_t)0x00000010) /*!< Channel 4 enable bit */
#define TSC_CHNEN_CHN_SEL5  ((uint32_t)0x00000020) /*!< Channel 5 enable bit */
#define TSC_CHNEN_CHN_SEL6  ((uint32_t)0x00000040) /*!< Channel 6 enable bit */
#define TSC_CHNEN_CHN_SEL7  ((uint32_t)0x00000080) /*!< Channel 7 enable bit */
#define TSC_CHNEN_CHN_SEL8  ((uint32_t)0x00000100) /*!< Channel 8 enable bit */
#define TSC_CHNEN_CHN_SEL9  ((uint32_t)0x00000200) /*!< Channel 9 enable bit */
#define TSC_CHNEN_CHN_SEL10 ((uint32_t)0x00000400) /*!< Channel 10 enable bit */
#define TSC_CHNEN_CHN_SEL11 ((uint32_t)0x00000800) /*!< Channel 11 enable bit */
#define TSC_CHNEN_CHN_SEL12 ((uint32_t)0x00001000) /*!< Channel 12 enable bit */
#define TSC_CHNEN_CHN_SEL13 ((uint32_t)0x00002000) /*!< Channel 13 enable bit */
#define TSC_CHNEN_CHN_SEL14 ((uint32_t)0x00004000) /*!< Channel 14 enable bit */
#define TSC_CHNEN_CHN_SEL15 ((uint32_t)0x00008000) /*!< Channel 15 enable bit */
#define TSC_CHNEN_CHN_SEL16 ((uint32_t)0x00010000) /*!< Channel 16 enable bit */
#define TSC_CHNEN_CHN_SEL17 ((uint32_t)0x00020000) /*!< Channel 17 enable bit */
#define TSC_CHNEN_CHN_SEL18 ((uint32_t)0x00040000) /*!< Channel 18 enable bit */
#define TSC_CHNEN_CHN_SEL19 ((uint32_t)0x00080000) /*!< Channel 19 enable bit */
#define TSC_CHNEN_CHN_SEL20 ((uint32_t)0x00100000) /*!< Channel 20 enable bit */
#define TSC_CHNEN_CHN_SEL21 ((uint32_t)0x00200000) /*!< Channel 21 enable bit */
#define TSC_CHNEN_CHN_SEL22 ((uint32_t)0x00400000) /*!< Channel 22 enable bit */
#define TSC_CHNEN_CHN_SEL23 ((uint32_t)0x00800000) /*!< Channel 23 enable bit */

/*****************  Bit definition for TSC_RESR0 register  *****************/
#define TSC_RESR0_CHN_RESIST0       ((uint32_t)0x00000007) /*!< TSC_RESR 0 channel 0 */
#define TSC_RESR0_CHN_RESIST1       ((uint32_t)0x00000070) /*!< TSC_RESR 0 channel 1 */
#define TSC_RESR0_CHN_RESIST2       ((uint32_t)0x00000700) /*!< TSC_RESR 0 channel 2 */
#define TSC_RESR0_CHN_RESIST3       ((uint32_t)0x00007000) /*!< TSC_RESR 0 channel 3 */
#define TSC_RESR0_CHN_RESIST4       ((uint32_t)0x00070000) /*!< TSC_RESR 0 channel 4 */
#define TSC_RESR0_CHN_RESIST5       ((uint32_t)0x00700000) /*!< TSC_RESR 0 channel 5 */
#define TSC_RESR0_CHN_RESIST6       ((uint32_t)0x07000000) /*!< TSC_RESR 0 channel 6 */
#define TSC_RESR0_CHN_RESIST7       ((uint32_t)0x70000000) /*!< TSC_RESR 0 channel 7 */

/*****************  Bit definition for TSC_RESR1 register  *****************/
#define TSC_RESR1_CHN_RESIST8       ((uint32_t)0x00000007) /*!< TSC_RESR 1 channel 0 */
#define TSC_RESR1_CHN_RESIST9       ((uint32_t)0x00000070) /*!< TSC_RESR 1 channel 1 */
#define TSC_RESR1_CHN_RESIST10       ((uint32_t)0x00000700) /*!< TSC_RESR 1 channel 2 */
#define TSC_RESR1_CHN_RESIST11       ((uint32_t)0x00007000) /*!< TSC_RESR 1 channel 3 */
#define TSC_RESR1_CHN_RESIST12       ((uint32_t)0x00070000) /*!< TSC_RESR 1 channel 4 */
#define TSC_RESR1_CHN_RESIST13       ((uint32_t)0x00700000) /*!< TSC_RESR 1 channel 5 */
#define TSC_RESR1_CHN_RESIST14       ((uint32_t)0x07000000) /*!< TSC_RESR 1 channel 6 */
#define TSC_RESR1_CHN_RESIST15       ((uint32_t)0x70000000) /*!< TSC_RESR 1 channel 7 */

/*****************  Bit definition for TSC_RESR2 register  *****************/
#define TSC_RESR2_CHN_RESIST16       ((uint32_t)0x00000007) /*!< TSC_RESR 2 channel 0 */
#define TSC_RESR2_CHN_RESIST17       ((uint32_t)0x00000070) /*!< TSC_RESR 2 channel 1 */
#define TSC_RESR2_CHN_RESIST18       ((uint32_t)0x00000700) /*!< TSC_RESR 2 channel 2 */
#define TSC_RESR2_CHN_RESIST19       ((uint32_t)0x00007000) /*!< TSC_RESR 2 channel 3 */
#define TSC_RESR2_CHN_RESIST20       ((uint32_t)0x00070000) /*!< TSC_RESR 2 channel 4 */
#define TSC_RESR2_CHN_RESIST21       ((uint32_t)0x00700000) /*!< TSC_RESR 2 channel 5 */
#define TSC_RESR2_CHN_RESIST22       ((uint32_t)0x07000000) /*!< TSC_RESR 2 channel 6 */
#define TSC_RESR2_CHN_RESIST23       ((uint32_t)0x70000000) /*!< TSC_RESR 2 channel 7 */



/*!< CHN_RESIST configuration */
#define TSC_RESR_CHN_RESIST_0 ((uint32_t)0x00000000) /*!< 1M ohm */
#define TSC_RESR_CHN_RESIST_1 ((uint32_t)0x00000001) /*!< 882K 0hm */
#define TSC_RESR_CHN_RESIST_2 ((uint32_t)0x00000002) /*!< 756K ohm */
#define TSC_RESR_CHN_RESIST_3 ((uint32_t)0x00000003) /*!< 630K ohm */
#define TSC_RESR_CHN_RESIST_4 ((uint32_t)0x00000000) /*!< 504K ohm */
#define TSC_RESR_CHN_RESIST_5 ((uint32_t)0x00000001) /*!< 378K ohm */
#define TSC_RESR_CHN_RESIST_6 ((uint32_t)0x00000002) /*!< 252K ohm */
#define TSC_RESR_CHN_RESIST_7 ((uint32_t)0x00000003) /*!< 126K ohm */

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

/**
 * @}
 */

#ifdef USE_STDPERIPH_DRIVER
#include "n32g032_conf.h"
#endif

#ifdef __cplusplus
}
#endif

#endif /* __N32G032_H__ */
